SubscriberService/exampleRequests/DeliverMIDASTrafficDataRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:ns3="http://datex2.eu/schema/2/2_0" xmlns:sub="http://www.thalesgroup.com/NTIS/SubscriberService"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header />
	<soapenv:Body>
		<sub:DeliverMIDASTrafficDataRequest>
			<sub:D2LogicalModel
				xmlns:ns2="http://www.thalesgroup.com/NTIS/Datex2Extensions/1.0Beta1"
				modelBaseVersion="2">
				<ns3:exchange>
					<ns3:supplierIdentification>
						<ns3:country>gb</ns3:country>
						<ns3:nationalIdentifier>NTIS DATEX II Traffic Data
						</ns3:nationalIdentifier>
					</ns3:supplierIdentification>
				</ns3:exchange>
				<ns3:payloadPublication lang="en"
					xsi:type="ns3:MeasuredDataPublication">
					<ns3:feedDescription>
						<ns3:values>
							<ns3:value>NTIS DATEX II
								Traffic Data</ns3:value>
						</ns3:values>
					</ns3:feedDescription>
					<ns3:feedType>MeasuredData
                                        </ns3:feedType>
					<ns3:publicationTime>2011-10-25T13:34:52.228+01:00
					</ns3:publicationTime>
					<ns3:publicationCreator>
						<ns3:country>gb</ns3:country>
						<ns3:nationalIdentifier>NTIS DATEX II Traffic Data
						</ns3:nationalIdentifier>
					</ns3:publicationCreator>
					<ns3:measurementSiteTableReference
						id="10" targetClass="MeasurementSiteTable" version="1" />
					<ns3:headerInformation>
						<ns3:confidentiality>noRestriction</ns3:confidentiality>
						<ns3:informationStatus>real</ns3:informationStatus>
						<ns3:urgency>normalUrgency</ns3:urgency>
					</ns3:headerInformation>
					<ns3:siteMeasurements>
						<ns3:measurementSiteReference id="1DC5B964C21449609644EBC759254D66"
							targetClass="MeasurementSiteRecord" version="" />
						<ns3:measurementTimeDefault>2011-10-25T13:27:00.000+01:00
						</ns3:measurementTimeDefault>
						<ns3:measuredValue index="0">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficSpeed">
									<ns3:averageVehicleSpeed>
										<ns3:dataError>false</ns3:dataError>
										<ns3:speed>97.0</ns3:speed>
									</ns3:averageVehicleSpeed>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="1">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficFlow">
									<ns3:vehicleFlow>
										<ns3:dataError>false</ns3:dataError>
										<ns3:vehicleFlowRate>4</ns3:vehicleFlowRate>
									</ns3:vehicleFlow>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="2">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficFlow">
									<ns3:vehicleFlow>
										<ns3:dataError>false</ns3:dataError>
										<ns3:vehicleFlowRate>0</ns3:vehicleFlowRate>
									</ns3:vehicleFlow>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="3">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficFlow">
									<ns3:vehicleFlow>
										<ns3:dataError>false</ns3:dataError>
										<ns3:vehicleFlowRate>15</ns3:vehicleFlowRate>
									</ns3:vehicleFlow>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="4">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficFlow">
									<ns3:vehicleFlow>
										<ns3:dataError>false</ns3:dataError>
										<ns3:vehicleFlowRate>2</ns3:vehicleFlowRate>
									</ns3:vehicleFlow>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="5">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficHeadway">
									<ns3:averageTimeHeadway>
										<ns3:dataError>true</ns3:dataError>
										<ns3:duration>1.5</ns3:duration>
									</ns3:averageTimeHeadway>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="6">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficConcentration">
									<ns3:occupancy>
										<ns3:dataError>false</ns3:dataError>
										<ns3:percentage>5.0</ns3:percentage>
									</ns3:occupancy>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="7">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficSpeed">
									<ns3:averageVehicleSpeed>
										<ns3:dataError>false</ns3:dataError>
										<ns3:speed>110.0</ns3:speed>
									</ns3:averageVehicleSpeed>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="8">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficFlow">
									<ns3:vehicleFlow>
										<ns3:dataError>false</ns3:dataError>
										<ns3:vehicleFlowRate>16</ns3:vehicleFlowRate>
									</ns3:vehicleFlow>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="9">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficFlow">
									<ns3:vehicleFlow>
										<ns3:dataError>false</ns3:dataError>
										<ns3:vehicleFlowRate>73</ns3:vehicleFlowRate>
									</ns3:vehicleFlow>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="10">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficFlow">
									<ns3:vehicleFlow>
										<ns3:dataError>false</ns3:dataError>
										<ns3:vehicleFlowRate>65</ns3:vehicleFlowRate>
									</ns3:vehicleFlow>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="11">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficFlow">
									<ns3:vehicleFlow>
										<ns3:dataError>false</ns3:dataError>
										<ns3:vehicleFlowRate>1</ns3:vehicleFlowRate>
									</ns3:vehicleFlow>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="12">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficHeadway">
									<ns3:averageTimeHeadway>
										<ns3:dataError>false</ns3:dataError>
										<ns3:duration>29.5</ns3:duration>
									</ns3:averageTimeHeadway>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="13">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficConcentration">
									<ns3:occupancy>
										<ns3:dataError>false</ns3:dataError>
										<ns3:percentage>16.0</ns3:percentage>
									</ns3:occupancy>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="14">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficSpeed">
									<ns3:averageVehicleSpeed>
										<ns3:dataError>false</ns3:dataError>
										<ns3:speed>131.0</ns3:speed>
									</ns3:averageVehicleSpeed>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="15">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficFlow">
									<ns3:vehicleFlow>
										<ns3:dataError>false</ns3:dataError>
										<ns3:vehicleFlowRate>7</ns3:vehicleFlowRate>
									</ns3:vehicleFlow>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="16">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficFlow">
									<ns3:vehicleFlow>
										<ns3:dataError>false</ns3:dataError>
										<ns3:vehicleFlowRate>23</ns3:vehicleFlowRate>
									</ns3:vehicleFlow>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="17">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficFlow">
									<ns3:vehicleFlow>
										<ns3:dataError>false</ns3:dataError>
										<ns3:vehicleFlowRate>0</ns3:vehicleFlowRate>
									</ns3:vehicleFlow>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="18">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficFlow">
									<ns3:vehicleFlow>
										<ns3:dataError>false</ns3:dataError>
										<ns3:vehicleFlowRate>86</ns3:vehicleFlowRate>
									</ns3:vehicleFlow>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="19">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficHeadway">
									<ns3:averageTimeHeadway>
										<ns3:dataError>false</ns3:dataError>
										<ns3:duration>12.4</ns3:duration>
									</ns3:averageTimeHeadway>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
						<ns3:measuredValue index="20">
							<ns3:measuredValue>
								<ns3:measurementEquipmentTypeUsed>
									<ns3:values>
										<ns3:value>loop</ns3:value>
									</ns3:values>
								</ns3:measurementEquipmentTypeUsed>
								<ns3:basicData xsi:type="ns3:TrafficConcentration">
									<ns3:occupancy>
										<ns3:dataError>false</ns3:dataError>
										<ns3:percentage>25.0</ns3:percentage>
									</ns3:occupancy>
								</ns3:basicData>
							</ns3:measuredValue>
						</ns3:measuredValue>
					</ns3:siteMeasurements>
				</ns3:payloadPublication>
			</sub:D2LogicalModel>
		</sub:DeliverMIDASTrafficDataRequest>
	</soapenv:Body>
</soapenv:Envelope>